Revit 2027 API
DesignOption.GetActiveDesignOptionId Method
 Gets the active design option id for the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetActiveDesignOptionId(
	Document document
)
Public Shared Function GetActiveDesignOptionId (
	document As Document
) As ElementId
public:
static ElementId^ GetActiveDesignOptionId(
	Document^ document
)
static member GetActiveDesignOptionId :
        document : Document -> ElementId
Parameters
document Document
 The document.
Return Value
ElementId
 The active design option id. It can be invalid id if there is no active design option in the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DesignOption Class
Autodesk.Revit.DB Namespace